data_talisman_suffix = ['亭', '伞', '冰', '刀', '刺', '剑', '印', '图', '塔', '尺', '山', '峰', '幡', '弓', '弩', '戈', '戒', '戟', '扇', '斧', '旗', '晶', '枪', '梭', '棍', '水', '火', '炎', '焰', '爪', '牌', '牙', '环', '玺', '珠', '琴', '瓶', '甲', '电', '盘', '目', '盾', '眼', '睛', '矛', '石', '砂', '碑', '简', '索', '绫', '网', '罩', '羽', '翅', '舟', '葫芦', '衣', '袋', '角', '车', '轮', '针', '钉', '钟', '钩', '铃', '链', '锁', '锤', '镖', '镜', '镯', '雷', '鞭', '骰', '魂', '鳞', '鼎', '鼓']

data_talisman_state = ['仿制品', '未完成', '次品', '破损', '赝品']

data_talisman_interfix = ['木', '水晶', '玉', '琉璃', '石', '竹', '金', '铁', '银', '骨']

data_skill_suffix = ['内功', '刀', '剑', '功', '劲', '吐纳术', '导引术', '御剑术', '御风术', '心法', '心诀', '手', '拳', '指', '掌', '擒拿手', '枪', '棍', '步', '步法', '气', '气功', '爪', '玄功', '神功', '神术', '神法', '神行法', '神通', '纵跃功', '绝技', '腿', '诀', '身法', '轻功', '轻身术', '遁术']

data_skill_numfix = ['一百零八', '七', '七十二', '三', '三十六', '九', '二十四', '五', '八', '八十一', '六', '六十四', '十', '十一', '十二', '十五', '十八', '四', '四十八']

data_skill_prefix = ['大', '小']

data_clan_suffix = ['世家', '书院', '会', '党', '刹', '剑派', '坊', '坞', '城', '堂', '堡', '塔', '宗', '客栈', '宫', '寨', '寺', '山', '山庄', '岛', '峰', '崖', '帮', '庄', '庙', '府', '庵', '房', '教', '斋', '旗', '村', '楼', '殿', '洞', '派', '狱', '盟', '社', '神教', '苑', '观', '谷', '轩', '道', '门', '阁', '院', '部落', '族', '联盟']

data_dao_male_suffix = ['上人', '仙', '仙人', '仙师', '仙翁', '天尊', '子', '教主', '法师', '洞主', '真人', '真君', '道人']

data_dao_stem = ['世', '临', '义', '乘', '乾', '了', '云', '亨', '享', '仁', '今', '会', '依', '信', '修', '元', '光', '全', '兴', '净', '凝', '刚', '初', '利', '功', '华', '印', '原', '参', '古', '可', '同', '启', '和', '哲', '善', '嘉', '圆', '坤', '奇', '妙', '始', '存', '宁', '宇', '安', '宏', '宗', '定', '宝', '宣', '容', '寂', '尽', '山', '崇', '希', '常', '幽', '广', '庆', '度', '延', '建', '弘', '微', '德', '志', '怀', '恒', '恭', '息', '悟', '悬', '悲', '惟', '惠', '愿', '慈', '慎', '慧', '成', '戒', '承', '敏', '敬', '方', '无', '昌', '明', '普', '景', '智', '朗', '木', '本', '极', '果', '格', '正', '永', '法', '泰', '泽', '济', '海', '润', '深', '淳', '清', '湛', '源', '澄', '灵', '炼', '玄', '玉', '理', '生', '益', '相', '真', '知', '礼', '神', '祥', '禅', '福', '秀', '秘', '空', '立', '章', '端', '素', '纯', '经', '维', '罗', '胜', '能', '至', '花', '茂', '荣', '莲', '藏', '虚', '融', '行', '衍', '觉', '言', '诚', '谨', '贞', '贤', '贯', '贵', '远', '通', '道', '量', '鉴', '镜', '闻', '阳', '阴', '隆', '霄', '静', '颖', '高', '黄', '龙']

data_dao_female_suffix = ['仙', '仙女', '仙子', '公主', '圣女', '圣母', '娘娘', '子', '教母', '法师', '洞主', '真人', '道姑']

data_nation_suffix = ['国']

data_nation_interfix = ['公', '神', '鬼', '仙', '帝', '妖', '王', '天', '上', '共和', '联合王', '神圣帝']

data_shared_color = ['乌', '墨', '暗', '灰', '白', '碧', '紫', '赤', '青', '黑']

data_shared_action = ['乘风', '乘龙', '伏仙', '伏天', '伏神', '伏虎', '伏魔', '伏龙', '兴云', '养仙', '养天', '养志', '养气', '养神', '养魂', '养魔', '养龙', '凌云', '凌虚', '分神', '分花', '劈地', '勾魂', '化功', '化影', '化灵', '化煞', '化脉', '化血', '化骨', '化魂', '叱灵', '合体', '吞星', '吞象', '听雨', '听雪', '吸星', '噬魂', '困仙', '困佛', '困天', '困妖', '困神', '困魔', '困龙', '失魂', '守一', '守仙', '守天', '守神', '守魔', '守龙', '定影', '定慧', '定海', '定风', '寻梅', '封仙', '封天', '封神', '封魂', '封魔', '封龙', '度厄', '度难', '开天', '开山', '开弓', '开碑', '弄雾', '御风', '御龙', '戮仙', '戮佛', '戮天', '戮妖', '戮神', '戮魂', '戮魔', '戮龙', '扫尘', '扫霞', '护仙', '护天', '护神', '护魔', '护龙', '抱元', '拂云', '拂柳', '担山', '掠影', '控鹤', '掷灵', '摄魂', '摘星', '摧心', '擒龙', '散势', '斩妖', '斩铁', '断魂', '易筋', '望月', '架海', '泣灵', '洗髓', '洞真', '洞虚', '浮光', '浮花', '消冰', '游身', '灭神', '灭魔', '炼气', '炼虚', '炼血', '照天', '照妖', '照神', '碎玉', '离尘', '离梦', '移星', '筑基', '结丹', '绝仙', '绝天', '绝情', '绝神', '绝魔', '绝龙', '缠丝', '荡魔', '落阳', '落魂', '葬花', '诛仙', '诛佛', '诛天', '诛妖', '诛神', '诛魔', '诛龙', '踏雪', '辟邪', '还魂', '迷仙', '追风', '追魂', '锁仙', '锁天', '锁妖', '锁神', '锁魂', '锁魔', '锁龙', '镇魔', '问天', '问情', '降魔', '降龙', '陨玉', '震山', '震岳', '飞渡', '驱魔']

data_shared_dao = ['上清', '不念', '中孚', '云环', '修罗', '元始', '光相', '兜率', '内景', '合欢', '周天', '坐忘', '大品', '大衍', '大赤', '太保', '太微', '太清', '太祖', '奇经', '奇门', '如意', '子母', '守拙', '宝色', '巨阙', '异相', '归藏', '心意', '慈悲', '无色', '昆吾', '星枢', '普贤', '极乐', '枯荣', '欢喜', '洞玄', '涅槃', '混世', '清微', '潇湘', '灵宝', '灵悟', '灵枢', '灵武', '玉清', '玉虚', '玲珑', '璇玑', '百合', '真武', '神宝', '神机', '神照', '禅音', '禹余', '素问', '紫微', '罗刹', '罗汉', '罗烟', '般若', '芙蓉', '若愚', '莲华', '菩提', '轩辕', '轮回', '达摩', '连山', '遁甲', '道德', '金刚', '长生', '雌雄', '霸王', '静禅']

data_shared_spirit = ['仙', '古', '宝', '灵', '玄', '真', '神', '秘', '精', '鬼', '魔']

data_shared_adj = ['一字', '大力', '沛然', '清净', '玄冥', '玄微', '玄阴', '素光', '素心', '素银', '紫霞', '缥缈', '赤霄', '迷踪', '逍遥', '通天', '通臂', '通身', '金光', '金霞', '青面']

data_shared_strange = ['上申', '不周', '丑阳', '中曲', '中父', '丹熏', '丹穴', '丹粟', '义渠', '乐马', '仁举', '仆勾', '仑者', '会稽', '凤尾', '凤麟', '列涂', '勾芒', '区吴', '单张', '单狐', '南禺', '博望', '卢其', '厌火', '发爽', '发鸠', '句余', '周饶', '咸阴', '嘉荣', '堂庭', '大时', '天池', '天虞', '太华', '奇肱', '姑射', '姑灌', '姑逢', '婴梁', '孟门', '宜苏', '宜诸', '宪翼', '尧光', '崇吾', '嶓冡', '帝休', '彭毗', '成侯', '招摇', '支离', '放皋', '敖岸', '敦与', '敦题', '数历', '数斯', '无条', '服常', '朝歌', '柔利', '梁渠', '求如', '泰冒', '泰头', '浑夕', '浮玉', '涿光', '漆吴', '潘侯', '灌湘', '灌题', '灭蒙', '熊耳', '犀渠', '狐岐', '王屋', '瑶碧', '申首', '留牛', '白于', '皋涂', '瞿如', '瞿父', '碣石', '祝余', '祝融', '积石', '空桑', '符禺', '箕尾', '结匈', '维龙', '翼望', '聚窟', '肥遗', '育遗', '胡射', '苍梧', '荆杞', '蒙木', '虎首', '虫尾', '蛊雕', '蠃母', '诸余', '诸怀', '诸次', '诸毗', '诸钩', '谯明', '边春', '钩吾', '长右', '长留', '长石', '阳华', '阳夹', '陆浑', '陵居', '隅阳', '雁门', '领胡', '题首', '马嵬', '马成', '高前', '高柳', '鲜虞', '鸟危', '鹿台', '鹿吴', '鹿蹄', '龙侯', '龙首']

data_shared_number = ['一元', '一气', '一阳', '七宝', '七巧', '七弦', '七彩', '七星', '七杀', '七煞', '七香', '万仙', '万刃', '万剑', '万花', '万里', '万魂', '三世', '三元', '三危', '三尸', '三才', '三昧', '三清', '三生', '两仪', '两界', '九华', '九天', '九宫', '九幽', '九曜', '九曲', '九炼', '九转', '九阳', '九阴', '九鼎', '九龙', '二气', '五光', '五彩', '五毒', '五气', '五火', '五色', '五花', '五行', '五阳', '五阴', '五雷', '五鬼', '五龙', '先天', '八卦', '八方', '八目', '八级', '八脉', '八门', '六丁', '六合', '六弦', '六甲', '六虚', '六阳', '六阴', '十方', '千机', '千里', '千钧', '四方', '四海', '四象', '大成', '大荒', '太一', '太乙', '太元', '太初', '太始', '太极', '太玄', '太阳', '太阴', '寒阴', '少阳', '少阴', '希夷', '归一', '归元', '无上', '无为', '无妄', '无定', '无常', '无形', '无影', '无极', '无根', '无涯', '无相', '无终', '无踪', '无量', '朝元', '正气', '浑元', '混元', '混天', '混沌', '百丈', '百仙', '百兽', '百毒', '百灵', '百炼', '百花', '百里', '百鬼', '百魔', '空冥', '紫阳', '纯阳', '纯阴', '虚空', '阴阳']

data_shared_clan = ['东华', '东海', '北斗', '北海', '华山', '南华', '南斗', '南海', '哀牢', '天山', '太行', '少林', '峨眉', '崆峒', '嵩山', '恒山', '昆仑', '武夷', '武当', '泰山', '点苍', '终南', '蓬莱', '衡山', '西域', '西海', '须弥']

data_shared_thing = ['寒风', '幻梦', '彩云', '昇阳', '朱砂', '柔云', '桃花', '梅花', '梨花', '残虹', '残魂', '流星', '灵丹', '烟雨', '玄天', '玄女', '玄武', '玄都', '玄门', '琼花', '白云', '白玉', '白眉', '白虹', '紫云', '紫府', '紫霄', '罡风', '花雨', '莲花', '金玉', '金砂', '金身', '金阙', '长春', '长风', '阴风', '霹雳', '青云', '青竹', '青花', '青莲', '风雨', '飞云', '黄泉', '黄竹', '黑木', '黑石']

data_shared_place = ['万', '丰', '丽', '义', '乐', '云', '交', '亳', '信', '元', '兴', '冀', '凉', '单', '历', '吉', '咸', '固', '夏', '夷', '宁', '安', '定', '宣', '容', '宿', '岐', '岚', '岷', '崂', '巴', '常', '平', '并', '幽', '广', '庆', '应', '德', '惠', '成', '扬', '抚', '文', '时', '明', '易', '晋', '景', '朔', '柳', '栾', '梁', '梅', '永', '池', '泉', '泰', '泸', '洪', '济', '浦', '浮', '涿', '淮', '清', '渤', '渭', '滁', '满', '滨', '潞', '潮', '瀛', '灵', '炎', '焦', '燕', '狄', '玄', '琼', '申', '盂', '益', '眉', '福', '竹', '羽', '聊', '苗', '英', '荆', '莱', '葛', '蒲', '蓟', '虹', '襄', '贺', '赤', '越', '辽', '鄂', '钦', '长', '随', '雄', '雍', '霸', '青', '顺', '鲜']

data_shared_gesture = ['别离', '参合', '开阖', '来去', '离别', '离合', '穿梭', '纵横', '连环']

data_shared_element = ['光明', '冥河', '冰火', '古仙', '古佛', '地仙', '地宝', '地煞', '天仙', '天兵', '天地', '天宝', '天宫', '天师', '天府', '天枢', '天火', '天照', '天罡', '天雷', '天魔', '寒冰', '幽冥', '日月', '晶炎', '水火', '火元', '火焰', '烈火', '焰光', '玄冰', '神火', '雷火', '雷电', '青焰', '风火', '风雷']

data_shared_creature = ['仙猿', '仙鹤', '凤凰', '天蝉', '天龙', '孔雀', '帝女', '应龙', '星女', '朱雀', '毒龙', '游龙', '火龙', '灵兔', '灵猴', '灵猿', '灵蛇', '灵鳌', '灵鹤', '灵龟', '烛龙', '燕子', '狂龙', '狮吼', '狮啸', '狮子', '玄龟', '玉女', '白虎', '神龙', '神龟', '素女', '老虎', '苍狼', '蝴蝶', '螳螂', '蟠龙', '野熊', '金童', '金蛇', '青龙', '飞燕', '鴛鴦', '麒麟', '龙虎']

data_creature_suffix = ['兔', '兽', '凤', '凤凰', '参', '天鹅', '孔雀', '木', '树', '棘', '熊', '燕', '牛', '犀', '犀牛', '犰狳', '狐', '狗', '狮', '狸', '狸猫', '狻猊', '狼', '猞猁', '猪', '猫', '猴', '猿', '竹', '羊', '芝', '花', '苔', '荆', '草', '藤', '虎', '虫', '蚕', '蚣', '蚯蚓', '蛇', '蛙', '蛟', '蛤', '蛤蟆', '蛾', '蜂', '蜈蚣', '蜥', '蜥蜴', '蝎', '蝙蝠', '蝠', '蝴蝶', '蝶', '蝾螈', '螂', '螃蟹', '螳螂', '蟹', '豚', '豹', '貔貅', '雀', '雕', '马', '魈', '鱼', '鲸', '鳄', '鳌', '鴛鴦', '鸟', '鸠', '鸡', '鸦', '鸬鹚', '鹅', '鹈鹕', '鹌鹑', '鹤', '鹦', '鹦鹉', '鹧鸪', '鹰', '鹿', '麒麟', '鼠', '龙', '龟']

data_creature_interfix = ['仙', '古', '灵', '玄', '神', '野', '鬼', '魔']

data_book_suffix = ['典', '图', '篆', '籍', '经']

data_book_state = ['抄本', '拓本', '摹本', '残卷', '残本', '残页', '过录本']

data_book_interfix = ['仙', '全', '宝', '总', '玄', '真', '秘', '魔']

data_place_suffix = ['乡', '关', '原', '县', '坞', '坡', '坪', '城', '域', '堡', '境', '大陆', '天', '宫', '寨', '寺', '山', '屿', '岗', '岛', '岭', '峰', '崖', '川', '州', '市', '庄', '府', '村', '林', '水', '汀', '江', '池', '河', '泊', '泽', '洋', '洞', '津', '洲', '海', '渚', '渡', '港', '湖', '湾', '潭', '界', '营', '观', '谷', '道', '郡', '镇', '驿']

data_name_male_suffix = ['世', '业', '东', '丞', '中', '丰', '举', '义', '书', '乾', '予', '云', '亮', '仁', '仕', '仙', '仪', '仲', '伊', '休', '会', '伟', '伦', '伯', '佑', '侗', '依', '俊', '保', '信', '俭', '修', '倡', '倾', '健', '儒', '兆', '先', '光', '全', '兰', '兴', '冬', '冷', '凌', '凤', '凯', '刚', '初', '利', '前', '勇', '勋', '勤', '千', '升', '华', '卓', '南', '博', '卿', '厚', '友', '叶', '司', '吉', '同', '君', '启', '哲', '嘉', '四', '国', '圣', '圭', '均', '坚', '坤', '培', '基', '堂', '墨', '壮', '声', '夜', '天', '奇', '奋', '奎', '威', '嫮', '孝', '孟', '季', '学', '宁', '宇', '宏', '官', '定', '宝', '宣', '宥', '宪', '宸', '容', '宾', '富', '寒', '尚', '尤', '展', '山', '岚', '峻', '川', '希', '常', '幕', '年', '幼', '广', '庚', '庭', '康', '庸', '廷', '弘', '弦', '彦', '彩', '彬', '微', '德', '心', '志', '忠', '怿', '恒', '恩', '恺', '惠', '慈', '拓', '振', '捷', '擎', '政', '敏', '文', '斌', '斐', '新', '方', '旋', '旗', '既', '旭', '时', '昂', '昊', '昌', '明', '昕', '星', '春', '昭', '昱', '显', '晋', '晏', '晓', '晖', '晨', '景', '智', '暮', '曼', '月', '朔', '木', '朴', '权', '杜', '来', '杰', '松', '林', '枫', '柯', '栋', '树', '桂', '桦', '梓', '森', '楚', '歌', '武', '殿', '毅', '毛', '民', '汉', '汜', '江', '沅', '沛', '河', '治', '波', '泰', '泽', '洁', '洋', '洛', '洲', '洺', '济', '浩', '海', '润', '淑', '淮', '深', '清', '渊', '温', '游', '源', '澜', '濯', '瀚', '灵', '灿', '炎', '炜', '炫', '炳', '烨', '焕', '然', '煊', '煜', '照', '熙', '玄', '玉', '玮', '珍', '珏', '珵', '理', '琛', '琬', '琰', '瑜', '瑞', '瑾', '璋', '璐', '生', '皓', '盛', '真', '睿', '硕', '礼', '祁', '祥', '祺', '禄', '福', '离', '秀', '秉', '科', '程', '稷', '章', '竹', '简', '素', '绍', '绎', '络', '美', '羽', '翊', '翌', '翔', '翰', '翼', '翾', '耀', '聪', '胜', '能', '臣', '致', '舒', '航', '良', '艺', '芬', '芳', '苑', '苗', '英', '茂', '茗', '荣', '菀', '菱', '蔚', '虎', '衍', '衡', '衿', '裕', '裴', '言', '诚', '谦', '谷', '贞', '贤', '贵', '赫', '起', '跃', '路', '轩', '辉', '辰', '达', '迅', '运', '远', '选', '通', '逾', '道', '遥', '邦', '邺', '里', '野', '金', '钧', '铭', '锋', '锡', '锦', '锵', '问', '闲', '阳', '陆', '陌', '隆', '雄', '雅', '雨', '霄', '霆', '震', '霖', '青', '靖', '静', '靳', '韬', '顺', '顾', '风', '飞', '馨', '驹', '骐', '骞', '骥', '高', '魁', '鸣', '鸿', '鹏', '鹤', '鹭', '麒', '麟', '黎', '默', '鼎', '齐', '龙']

data_name_interfix = ['一', '万', '不', '与', '且', '为', '乃', '之', '乐', '也', '予', '于', '亦', '仅', '今', '从', '以', '何', '依', '修', '允', '元', '充', '克', '入', '公', '兴', '其', '再', '准', '凌', '凝', '则', '化', '又', '可', '向', '含', '听', '和', '咏', '唯', '因', '在', '垂', '士', '复', '大', '如', '子', '学', '安', '宗', '宜', '客', '容', '寻', '少', '尔', '展', '岂', '崇', '已', '广', '庆', '应', '延', '建', '弃', '必', '忆', '忍', '念', '怀', '思', '恨', '惜', '成', '所', '才', '扬', '承', '振', '摇', '敬', '无', '易', '更', '有', '望', '朝', '染', '梦', '正', '永', '游', '潜', '然', '照', '献', '生', '由', '留', '眠', '知', '立', '竟', '笑', '继', '维', '羡', '者', '而', '自', '若', '落', '融', '行', '谈', '近', '进', '追', '采', '长', '非', '飞']

data_name_female_suffix = ['世', '丞', '中', '丹', '丽', '书', '云', '亚', '京', '亭', '亿', '代', '令', '仪', '伊', '优', '会', '伶', '佩', '佳', '依', '俞', '俪', '倩', '偲', '兮', '兰', '冉', '冬', '冰', '凌', '凝', '凡', '凤', '初', '勤', '卉', '华', '卓', '南', '卿', '双', '叶', '吉', '君', '含', '听', '咏', '哲', '唤', '喻', '嘉', '园', '垣', '壬', '声', '夏', '夕', '天', '奕', '好', '妃', '妍', '妙', '妤', '妩', '妮', '妹', '姗', '姝', '姣', '姬', '姿', '娅', '娆', '娇', '娈', '娉', '娜', '娟', '娣', '娥', '娴', '婉', '婕', '婧', '婵', '婷', '婼', '媚', '媛', '嫔', '嫣', '嫦', '嫱', '孝', '宁', '宇', '宛', '宝', '容', '寒', '寻', '尚', '尹', '岚', '岩', '巧', '希', '幻', '康', '弈', '弘', '彤', '彦', '彩', '影', '微', '德', '徽', '心', '念', '怜', '怡', '恬', '悠', '悦', '情', '惠', '愉', '慎', '慕', '慧', '懿', '抒', '振', '攸', '敏', '文', '斐', '斯', '新', '旋', '旭', '昊', '星', '春', '昭', '昱', '晓', '晗', '晨', '景', '晴', '晶', '曜', '曦', '曼', '月', '杨', '杭', '林', '枝', '枫', '柄', '柔', '柯', '柳', '栩', '格', '桂', '桃', '桐', '桢', '梅', '梓', '棋', '森', '楚', '楠', '橙', '欢', '欣', '殷', '毓', '沁', '沛', '泉', '泊', '泽', '洁', '洲', '洵', '海', '涵', '淇', '淑', '清', '渥', '温', '湄', '湘', '源', '溪', '溱', '滔', '滟', '滢', '漫', '潍', '澄', '澜', '灏', '灵', '灼', '炜', '烟', '煦', '熙', '燕', '燨', '爱', '爽', '猗', '献', '玉', '玖', '玥', '环', '玲', '珂', '珊', '珍', '珠', '珺', '琇', '琚', '琛', '琦', '琪', '琬', '琰', '琳', '琴', '琼', '瑗', '瑛', '瑜', '瑞', '瑶', '瑷', '瑾', '璎', '璐', '璧', '瓒', '田', '画', '畅', '白', '的', '皎', '皖', '盈', '益', '盼', '眉', '真', '睿', '研', '礼', '禹', '禾', '秀', '秉', '秋', '穆', '窈', '竞', '童', '竹', '笑', '筠', '筱', '简', '素', '紫', '红', '纨', '纯', '绥', '绮', '绿', '缉', '缨', '美', '羽', '翊', '翌', '翕', '翠', '翰', '聪', '育', '臻', '舒', '舜', '舟', '艳', '艺', '艾', '芃', '芊', '芙', '芝', '芬', '芮', '芯', '芳', '芷', '芸', '芹', '苏', '苑', '苓', '英', '苾', '茗', '茜', '茵', '茹', '荔', '荟', '荣', '荷', '莉', '莎', '莲', '莹', '莺', '菁', '菊', '菡', '菱', '菲', '萌', '萍', '萧', '萱', '葛', '葶', '蓁', '蓉', '蓓', '蓝', '蔚', '蕊', '蕙', '蕾', '薇', '虹', '蝶', '融', '衣', '言', '诗', '语', '诺', '谷', '豫', '贝', '贞', '贤', '贻', '赫', '轩', '辰', '远', '逸', '邦', '重', '金', '鑫', '钟', '铃', '铭', '锐', '锘', '锦', '镒', '闵', '闻', '阳', '陶', '雁', '雅', '雨', '雪', '雯', '零', '霄', '霏', '霖', '霜', '霞', '霭', '露', '青', '靖', '静', '音', '韵', '颖', '颜', '飘', '飞', '香', '馥', '馨', '驰', '骏', '鸿', '鹭', '鹰', '麒', '黛', '齐']

data_name_prefix = ['丁', '万', '上官', '东方', '严', '乐', '乔', '于', '令狐', '仲', '任', '伍', '何', '余', '侯', '俞', '倪', '傅', '兰', '关', '冯', '冷', '凌', '刘', '南宫', '卢', '史', '叶', '司徒', '司空', '司马', '吉', '向', '吕', '吴', '周', '唐', '商', '墨', '夏', '夏侯', '姚', '姜', '姬', '孔', '孙', '孟', '季', '宁', '安', '宋', '封', '尤', '尹', '屈', '岳', '崔', '席', '常', '庄', '庞', '康', '廖', '张', '彭', '徐', '慕容', '戚', '戴', '敖', '文', '方', '施', '易', '晏', '曲', '曹', '曾', '朱', '李', '杜', '杨', '林', '查', '柯', '柳', '柴', '栾', '梁', '梅', '楚', '樊', '欧', '欧阳', '武', '段', '殷', '毕', '毛', '江', '池', '汤', '汪', '沈', '洪', '涂', '温', '漕', '潘', '澹台', '焦', '熊', '牛', '王', '甄', '田', '申', '白', '百里', '皇甫', '瞿', '石', '祁', '祝', '秦', '程', '章', '童', '端木', '管', '米', '纪', '罗', '翟', '耿', '聂', '胡', '艾', '花', '苏', '苗', '范', '莫', '萧', '葛', '董', '蒋', '蓝', '蔡', '蔺', '薛', '袁', '裴', '西门', '解', '詹', '许', '诸葛', '谢', '谭', '谷', '费', '贺', '贾', '赖', '赵', '路', '轩辕', '辛', '邓', '邢', '邱', '邵', '邹', '郑', '郝', '郭', '都', '金', '钱', '锺', '长孙', '闵', '阎', '阮', '陆', '陈', '陶', '霍', '韦', '韩', '项', '顾', '颜', '马', '高', '魏', '鲁', '鲍', '黄', '黎', '齐', '龙', '龚']

data_material_suffix = ['丝', '冰', '参', '叶', '尾', '岩', '晶', '曜石', '木', '果', '果壳', '果核', '树', '树根', '树皮', '毛', '水', '水晶', '汁', '泥', '浆', '液', '漆', '火', '炎', '焰', '爪', '牙', '玉', '玛瑙', '玳瑁', '珊瑚', '珍珠', '琥珀', '电', '皮', '目', '眼', '眼珠', '睛', '石', '砂', '碳', '竹', '精', '羽', '翅', '胶', '芝', '花', '苔', '草', '藤', '角', '蹄', '金', '钻', '铁', '铜', '银', '雷', '露', '须', '骨', '髓', '魂', '魄', '鳍', '鳞', '齿']

data_material_state = ['残破', '污损', '破损', '缺损']

data_alchemy_suffix = ['丸', '丹', '剂', '散', '汤', '茶', '药', '酒', '饮']

